load_tests/scenarios/02_viral_event.yml
config:
  ensure:
    conditions:
      - expression: "vusers.failed == 0"
      - expression: "errors == 0"
  target: "{{ $processEnvironment.REALTIME_GATEWAY_URL }}"
  socketio:
    query:
      token: "{{ access_token }}"
      sessionId: "loadtest_session"
      deviceId: "loadtest_device"
  phases:
    - duration: 30
      arrivalRate: 20
      name: "Viral ramp up"
  engines:
    socketio-v3: {}
  payload:
    path: "../users.csv"
    fields:
      - "user_id"
      - "email"
      - "password"
      - "access_token"
    order: "random"
    skipHeader: true
  processor: "../processor.js"

scenarios:
  - name: "Viral Event Burst"
    engine: "socketio-v3"
    flow:
      - function: "setupVuser"
      - emit:
          channel: "auth"
          data:
            token: "{{ access_token }}"
      - think: 1
      # Simulate a viral event where everyone is spamming messages very quickly
      - loop:
          - function: "beforeSendMessage"
          - emit:
              channel: "chat:message"
              data:
                conversationId: "viral_convo_id"
                content: "Viral message from {{ user_id }}"
                deviceId: "{{ deviceId }}"
          - think: 2
        count: 10